import platform


print(8*51)                                      # расчет 1
print(((8257-8854)*2)/3)                         # расчет 2
print(12+(143*(2-(2018+2045)-6)/9)*2)            # расчет 3
print("=====================================")   # тупо строка-разделитель
print(platform.system())                         # информация об ОСи
print("=====================================")   # тупо строка-разделитель
print(platform.processor())
print("=====================================")   # тупо строка-разделитель

